anyrun-git
aws-cli-v2
aylurs-gtk-shell
bfg
bibata-cursor-theme
binder_linux-dkms
docker-desktop
dropbox
gpu-passthrough-manager
gradience
hyprprop-git
iwgtk
kcat-cli
matugen-bin
nordic-theme
nvm
postman-bin
python-libsass
python-material-color-utilities
python-materialyoucolor-git
rtl8852au-dkms-git
snapd
thunar-dropbox
tmuxinator
ttf-gabarito-git
ttf-material-symbols-variable-git
ttf-readex-pro
ttf-rubik-vf
waydroid
wlogout-git
yay
zen-browser-bin
