anyrun-git
aws-cli-v2
aylurs-gtk-shell
bibata-cursor-theme
docker-desktop
dropbox
hyprpicker
iwgtk
matugen-bin
nordic-theme
nvm
rtl8852au-dkms-git
snapd
thunar-dropbox
tmuxinator
ttf-gabarito-git
ttf-material-symbols-variable-git
ttf-readex-pro
ttf-rubik-vf
wlogout-git
yay
yay-debug
