tap "eth-p/software"
tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Generic syntax highlighter
brew "pygments"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Tracks most-used directories to make cd smarter
brew "z"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
