tap "abdfnx/tap"
tap "arl/arl"
tap "bufbuild/buf"
tap "cmacrae/formulae"
tap "eth-p/software"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Another PostgreSQL diff tool
brew "apgdiff"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# AVH edition of git-flow
brew "git-flow-avh"
# Platform built on V8 to build network applications
brew "node"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# DevTools proxy for iOS devices
brew "ios-webkit-debug-proxy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Apache Kafka C/C++ library
brew "librdkafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# CLI calendar application
brew "khal"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Postgres C API library
brew "libpq", link: true
# Small memory footprint, flexible web-server
brew "lighttpd", restart_service: true
# Utility for directing compilation
brew "make"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Open Fortinet client for PPP+TLS VPN tunnel services
brew "openfortivpn"
# Development kit for the Java programming language
brew "openjdk@17"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Generic syntax highlighter
brew "pygments"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# JavaScript package manager
brew "yarn", link: false
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# A minimal status bar for macOS.
brew "cmacrae/formulae/spacebar"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd", args: ["HEAD"]
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# Remove junk and unused files
cask "ccleaner"
# Clipboard manager with advanced features
cask "copyq"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Plugin, App, and Theme store which includes plugin injection
cask "macforge"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Share peripherals between computers
cask "sharemouse"
# Controls screen display settings
cask "switchresx"
# Native GUI tool for relational databases
cask "tableplus"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
mas "ColorSlurp", id: 1287239339
mas "Disk Drill Media Recovery", id: 431224317
mas "EasyRes", id: 688211836
mas "GhostText", id: 1552641506
mas "Gifox", id: 1461845568
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Nitefall", id: 1575190591
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "The Unarchiver", id: 425424353
mas "Vimari", id: 1480933944

# vim:ft=ruby
