acpi
acpi_call
axel
base
base-devel
bash-completion
bat
bat-extras
bc
bind
blueman
bluez
bluez-utils
brightnessctl
btop
btrfs-progs
conntrack-tools
copyq
dart-sass
dhcpcd
dialog
discord
dmidecode
docker
efibootmgr
ethtool
eza
fd
firefox
flatpak
fq
fuse2
fzf
ghq
git
gnome-bluetooth-3.0
gnome-control-center
gnome-terminal
gnu-free-fonts
gparted
grub
gvfs
htop
hypridle
hyprland
hyprlock
intel-ucode
inxi
iw
jdk8-openjdk
keychain
kitty
kubectl
lazygit
libdbusmenu-gtk3
libva-nvidia-driver
linux
linux-firmware
linux-headers
lshw
lsof
maven
minikube
mtools
mtr
neofetch
neovim
net-tools
networkmanager
networkmanager-openvpn
nmap
nm-connection-editor
noto-fonts
noto-fonts-emoji
nsxiv
nvidia
nvidia-settings
nvidia-utils
nwg-look
obsidian
obs-studio
openbsd-netcat
openfortivpn
openssh
os-prober
papirus-icon-theme
pavucontrol
pipewire-alsa
pipewire-jack
pipewire-pulse
pnpm
polkit-kde-agent
postgresql-libs
powertop
pwgen
qt5ct
qt5-wayland
qt6ct
qt6-wayland
reflector
ripgrep
rsync
rust
samba
sddm
sof-firmware
sudo
swww
systemd-resolvconf
tcpdump
terminus-font
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
tldr
tlp
tlp-rdw
tmux
tree
ttf-dejavu
ttf-droid
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
ttf-roboto
ttf-ubuntu-font-family
tumbler
unzip
usb_modeswitch
vagrant
vim
virtualbox
vulkan-tools
wget
wireplumber
wl-clipboard
wofi
xdg-desktop-portal-hyprland
xsel
yq
zip
zsh
