acpi
acpi_call
ark
axel
base
base-devel
bash-completion
bat
bat-extras
bc
bind
blueberry
blueman
bluez
bluez-utils
brightnessctl
btop
btrfs-progs
clipnotify
conntrack-tools
copyq
cpio
cronie
dart-sass
ddcutil
dhcpcd
dialog
discord
dmidecode
dnsmasq
docker
dpkg
efibootmgr
eog
ethtool
eza
fcitx5
fcitx5-configtool
fd
firefox
fish
flatpak
foot
fq
fuse2
fuzzel
fzf
gammastep
ghq
gimp
git
gnome-bluetooth-3.0
gnome-control-center
gnome-terminal
gnome-themes-extra
gnu-free-fonts
goverlay
gparted
greetd
grim
grub
gtksourceview3
gtksourceviewmm
gvfs
helvum
htop
hypridle
hyprland
hyprlock
hyprpicker
hyprutils
impala
intel-ucode
inxi
iptables-nft
iw
iwd
jdk8-openjdk
keepass
keychain
kitty
kubectl
lazygit
libdbusmenu-gtk3
libreoffice-fresh
libva-nvidia-driver
libvirt
libxpresent
linux
linux-firmware
linux-headers
lshw
lsof
make
maven
mesa-utils
minikube
mtools
mtr
neofetch
neovim
net-tools
networkmanager
network-manager-applet
networkmanager-openvpn
nmap
nm-connection-editor
noto-fonts
noto-fonts-emoji
nvidia
nvidia-settings
nvidia-utils
nwg-look
obsidian
obs-studio
openbsd-netcat
openfortivpn
openssh
os-prober
pacman-contrib
papirus-icon-theme
pavucontrol
pinta
pipewire-alsa
pipewire-jack
pipewire-pulse
playerctl
pnpm
polkit-gnome
polkit-kde-agent
postgresql-libs
power-profiles-daemon
powertop
pwgen
python-libsass
python-pillow
python-psutil
python-pywal
python-pywayland
python-setuptools-scm
qemu-full
qpwgraph
qt5ct
qt5-wayland
qt6ct
qt6-wayland
ranger
reflector
ripgrep
rsync
rust
samba
slurp
sof-firmware
sox
starship
sudo
swappy
swtpm
swww
systemd-resolvconf
tcpdump
terminus-font
tesseract
tesseract-data-eng
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
tinyxml2
tldr
tmux
traceroute
tree
ttf-dejavu
ttf-droid
ttf-jetbrains-mono
ttf-liberation
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
ttf-roboto
ttf-space-mono-nerd
ttf-ubuntu-font-family
tumbler
unzip
usb_modeswitch
vagrant
vim
virt-manager
virtualbox
virt-viewer
vulkan-tools
webp-pixbuf-loader
wf-recorder
wget
wireplumber
wl-clipboard
wofi
xclip
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-user-dirs-gtk
xorg-xhost
xsel
yad
ydotool
yq
zip
zsh
