alacritty
alsa-plugins
alsa-utils
arandr
arc-gtk-theme
aws-cli
axel
base
base-devel
bash-completion
bat
bat-extras
bc
bcc
bind
blueman
bluez
bluez-utils
brightnessctl
btop
btrfs-progs
conntrack-tools
copyq
dart-sass
dbeaver
dhcpcd
dialog
discord
dkms
dmidecode
docker
dunst
efibootmgr
ethtool
eza
fd
firefox
flameshot
flatpak
fuse2
fwupd
fzf
garcon
ghq
gimp
git
git-delta
gnome-bluetooth-3.0
gnome-control-center
gnome-terminal
gnu-free-fonts
gparted
grub
gvfs
htop
hypridle
hyprland
hyprlock
hyprpaper
imwheel
intel-ucode
inxi
iw
keychain
kitty
kubectl
languagetool
lazygit
linux
linux-firmware
linux-headers
lshw
lsof
luarocks
lxappearance
ly
mercurial
minikube
mpv
mtools
mtr
neofetch
neovide
neovim
net-tools
networkmanager
network-manager-applet
networkmanager-openvpn
nmap
nm-connection-editor
noto-fonts
noto-fonts-emoji
npm
nvidia-dkms
nvidia-settings
nvidia-utils
nwg-look
obsidian
openbsd-netcat
openfortivpn
openssh
os-prober
papirus-icon-theme
picom
pipewire-alsa
pipewire-jack
pipewire-pulse
polkit-kde-agent
postgresql-libs
powertop
python-pip
qt6-wayland
ranger
reflector
ripgrep
rsync
rust
samba
sddm
sof-firmware
speedtest-cli
strace
sudo
swww
sxhkd
systemd-resolvconf
tcpdump
terminus-font
thefuck
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
tldr
tmux
tree
ttf-dejavu
ttf-droid
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
ttf-roboto
ttf-ubuntu-font-family
tumbler
udisks2
unzip
usb_modeswitch
usbutils
vi
vim
w3m
wget
wl-clipboard
wofi
xautomation
xclip
xdg-desktop-portal-hyprland
xdg-utils
xdotool
xf86-video-vesa
xfce4-appfinder
xfce4-panel
xfce4-power-manager
xfce4-session
xfce4-settings
xfce4-terminal
xfdesktop
xfwm4
xfwm4-themes
xorg-bdftopcf
xorg-docs
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-font-util
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbprint
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xsel
yarn
yq
zip
zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
