com.github.tchx84.Flatseal
com.usebottles.bottles
com.valvesoftware.Steam
org.freedesktop.Platform
org.freedesktop.Platform.Compat.i386
org.freedesktop.Platform.GL.default
org.freedesktop.Platform.GL.default
org.freedesktop.Platform.GL.nvidia-555-58
org.freedesktop.Platform.GL.nvidia-555-58-02
org.freedesktop.Platform.GL32.default
org.freedesktop.Platform.GL32.default
org.freedesktop.Platform.GL32.nvidia-555-58
org.freedesktop.Platform.GL32.nvidia-555-58-02
org.freedesktop.Platform.ffmpeg-full
org.freedesktop.Platform.ffmpeg_full.i386
org.freedesktop.Platform.openh264
org.freedesktop.Platform.openh264
org.freedesktop.Sdk
org.gnome.Platform
org.gnome.Platform
org.gnome.Platform.Compat.i386
org.winehq.Wine.DLLs.dxvk
org.winehq.Wine.gecko
org.winehq.Wine.mono
